[{"UniqueId":"9784:0","Headline":"Clipper: A Tool for Seamlessly Converting HTML to Markdown for RAG Applications","BodyText":"Clipper is a tool that simplifies converting HTML to Markdown format for RAG applications. It allows users to clip content from web pages, crawl websites for comprehensive content gathering, and output the results in Markdown or JSON format. Clipper is easy to use, requiring only a simple installation process using the command \"npm install -g @philschmid/clipper\". It supports both URL and file inputs and offers optional output formats, including Markdown or JSON, with markdown and metadata. Clipper is particularly useful for building markdown datasets for training LLMs or integrating them into RAG pipelines for context retrieval.","ImageFileName":"8b66b1f0-86a1-4a9b-8c73-dc111a31b37c.png","ArticleFileName":"8b66b1f0-86a1-4a9b-8c73-dc111a31b37c.md","LinkToSource":"https://www.linkedin.com/posts/philipp-schmid-a6a2bb196_introducing-clipper-the-easiest-way-to-convert-activity-7149050723278737409-jCSM?utm_source=share&amp;utm_medium=member_android","CreationDate":null},{"UniqueId":"9784:0","Headline":"Clipper: Convert web content to Markdown with ease","BodyText":"Clipper, a new command-line tool developed by Philipp Schmid, allows users to easily convert web pages to Markdown format. This tool is especially useful for building Markdown datasets for training large language models (LLMs) or integrating web content into RAG pipelines for context retrieval. Clipper supports both URLs and file inputs, and it offers optional output formats in Markdown or JSON. With its crawl functionality, Clipper enables users to gather comprehensive website content, ensuring that the converted Markdown datasets are thorough and informative.","ImageFileName":"a121adb3-800f-45eb-a5b9-5602fa2d31f2.png","ArticleFileName":"a121adb3-800f-45eb-a5b9-5602fa2d31f2.md","LinkToSource":"https://www.linkedin.com/posts/philipp-schmid-a6a2bb196_introducing-clipper-the-easiest-way-to-convert-activity-7149050723278737409-jCSM?utm_source=share&utm_medium=member_android","CreationDate":null},{"UniqueId":"9722_0","Headline":"The Hands-on LLMs FREE course recently surpassed 750+ GitHub ⭐🌟⭐. This course teaches how to build hands-on LLM systems using LLMOps principles.","BodyText":"Paul Iusztin, a senior machine learning engineer, MLOps specialist, and independent contractor, announced that his \"Hands-on LLMs\" course has surpassed 750 GitHub stars. This free course, led by Iusztin and collaborators Pau Labarta and Alexandru Razvant, focuses on the practical application of building and deploying large language models (LLMs) while adhering to LLMOps principles.\n\nThe course consists of four video lessons and open-source code, aiming to teach participants how to construct a complete operational product that leverages LLMs, LLMOps, and a 3-pipeline design. This product will serve as a chatbot that provides financial advice based on real-time financial news. The three components participants will learn to build include a real-time streaming pipeline that monitors financial news, a fine-tuning pipeline that enhances the LLM's accuracy on financial data, and an inference pipeline that enables the LLM to answer financial questions using retrieved news articles. These pipelines are independently developed, deployed, and scaled to ensure modularity and clean code.\n\nThe course is targeted towards professionals in machine learning engineering, data engineering, data science, and software engineering who wish to gain expertise in engineering LLM systems using LLMOps principles. The course materials include four hands-on video lessons and open-source code accessible on GitHub.\n\nIusztin expressed his gratitude for the course's popularity, acknowledging the contributions of Labarta and Razvant in making the course possible. He also outlined the course's curriculum, emphasizing the focus on engineering and MLOps aspects instead of mere demonstrations of predictions in notebooks. Participants will gain hands-on experience in developing, deploying, and scaling modular and clean code pipelines.\n\nThe course also introduces various serverless tools, including Comet ML as the ML platform, Qdrant as the vector database, and Beam as the infrastructure. Iusztin encouraged individuals to follow his weekly newsletter for regular lessons on MLE and MLOps and invited them to join his upcoming webinar on comparing training experiments effectively.","ImageFileName":"227c5683-3786-4d30-a30a-dcda5bb11b1c.png","ArticleFileName":"227c5683-3786-4d30-a30a-dcda5bb11b1c.md","LinkToSource":"https://www.linkedin.com/posts/pauliusztin_machinelearning-mlops-datascience-activity-7143140533023023104-E4GZ?utm_source=share&amp;utm_medium=member_android","CreationDate":"2024-01-01T20:50:10Z"}]